brilliantlabsAR/frame-codebase/libraries/nrf5sdk/hal/nrf_power.h
#if NRF_POWER_HAS_VDDH
/**
 * @brief Function for setting the VDDH power failure comparator threshold.
 *
 * @param thr Threshold to be set.
 */
__STATIC_INLINE void nrf_power_pofcon_vddh_set(nrf_power_pof_thrvddh_t thr);

/**
 * @brief Function for getting the VDDH power failure comparator threshold.
 *
 * @return VDDH threshold currently configured.
 */
__STATIC_INLINE nrf_power_pof_thrvddh_t nrf_power_pofcon_vddh_get(void);
#endif // NRF_POWER_HAS_VDDH

/**
 * @brief Function for setting the general purpose retention register.
 *
 * @param[in] val Value to be set in the register.
 */
__STATIC_INLINE void nrf_power_gpregret_set(uint8_t val);

/**
 * @brief Function for getting general purpose retention register.
 *
 * @return The value from the register.
 */
__STATIC_INLINE uint8_t nrf_power_gpregret_get(void);

#if defined(POWER_GPREGRET2_GPREGRET_Msk) || defined(__NRFX_DOXYGEN__)
/**
 * @brief Function for setting the general purpose retention register 2.
 *
 * @note This register is not available in the nRF51 MCU family.
 *
 * @param[in] val Value to be set in the register.
 */
__STATIC_INLINE void nrf_power_gpregret2_set(uint8_t val);

/**
 * @brief Function for getting the general purpose retention register 2.
 *
 * @note This register is not available in all MCUs.
 *
 * @return The value from the register.
 */
__STATIC_INLINE uint8_t nrf_power_gpregret2_get(void);
#endif // defined(POWER_GPREGRET2_GPREGRET_Msk) || defined(__NRFX_DOXYGEN__)

/**
 * @brief Function for getting value of the particular general purpose retention register
 *
 * @param[in] reg_num General purpose retention register number.
 *
 * @return The value from the register
 */
__STATIC_INLINE uint8_t nrf_power_gpregret_ext_get(uint8_t reg_num);

/**
 * @brief Function for setting particular general purpose retention register.
 *
 * @param[in] reg_num General purpose retention register number.
 * @param[in] val     Value to be set in the register
 */
__STATIC_INLINE void nrf_power_gpregret_ext_set(uint8_t          reg_num,
                                                uint8_t          val);

#if NRF_POWER_HAS_DCDCEN
/**
 * @brief Enable or disable DCDC converter
 *
 * @note
 * If the device consist of high voltage power input (VDDH), this setting
 * will relate to the converter on low voltage side (1.3&nbsp;V output).
 *
 * @param[in] enable Set true to enable the DCDC converter or false to disable the DCDC converter.
 */
__STATIC_INLINE void nrf_power_dcdcen_set(bool enable);

/**
 * @brief Function for getting the state of the DCDC converter.
 *
 * @note
 * If the device consist of high voltage power input (VDDH), this setting
 * will relate to the converter on low voltage side (1.3&nbsp;V output).
 *
 * @retval true  Converter is enabled.
 * @retval false Converter is disabled.
 */
__STATIC_INLINE bool nrf_power_dcdcen_get(void);
#endif // NRF_POWER_HAS_DCDCEN

#if defined(POWER_RAM_POWER_S0POWER_Msk) || defined(__NRFX_DOXYGEN__)
/**
 * @brief Turn ON sections in the selected RAM block.
 *
 * This function turns ON several sections in one block and also block retention.
 *
 * @sa nrf_power_rampower_mask_t
 * @sa nrf_power_rampower_mask_off
 *
 * @param[in] block        RAM block index.
 * @param[in] section_mask Mask of the sections created by merging
 *                         @ref nrf_power_rampower_mask_t flags.
 */
__STATIC_INLINE void nrf_power_rampower_mask_on(uint8_t block, uint32_t section_mask);

/**
 * @brief Turn ON sections in the selected RAM block.
 *
 * This function turns OFF several sections in one block and also block retention.
 *
 * @sa nrf_power_rampower_mask_t
 * @sa nrf_power_rampower_mask_off
 *
 * @param[in] block        RAM block index.
 * @param[in] section_mask Mask of the sections created by merging
 *                         @ref nrf_power_rampower_mask_t flags.
 */
__STATIC_INLINE void nrf_power_rampower_mask_off(uint8_t block, uint32_t section_mask);

/**
 * @brief Function for getting the ON mask and retention sections in the selected RAM block.
 *
 * @param[in] block RAM block index.
 *
 * @return Mask of sections state composed from @ref nrf_power_rampower_mask_t flags.
 */
__STATIC_INLINE uint32_t nrf_power_rampower_mask_get(uint8_t block);
#endif /* defined(POWER_RAM_POWER_S0POWER_Msk) || defined(__NRFX_DOXYGEN__) */

#if NRF_POWER_HAS_DCDCEN_VDDH
/**
 * @brief Function for enabling or disabling the DCDC converter on VDDH.
 *
 * @param enable Set true to enable the DCDC converter or false to disable the DCDC converter.
 */
__STATIC_INLINE void nrf_power_dcdcen_vddh_set(bool enable);

/**
 * @brief Function for getting the state of DCDC converter on VDDH.
 *
 * @retval true  Converter is enabled.
 * @retval false Converter is disabled.
 */
__STATIC_INLINE bool nrf_power_dcdcen_vddh_get(void);
#endif // NRF_POWER_HAS_DCDCEN_VDDH

#if NRF_POWER_HAS_VDDH
/**
 * @brief Function for getting the main supply status.
 *
 * @return The current main supply status.
 */
__STATIC_INLINE nrf_power_mainregstatus_t nrf_power_mainregstatus_get(void);
#endif // NRF_POWER_HAS_VDDH

#if NRF_POWER_HAS_USBREG
/**
 * @brief Function for getting the whole USBREGSTATUS register.
 *
 * @return The USBREGSTATUS register value.
 *         Use @ref nrf_power_usbregstatus_mask_t values for bit masking.
 *
 * @sa nrf_power_usbregstatus_vbusdet_get
 * @sa nrf_power_usbregstatus_outrdy_get
 */
__STATIC_INLINE uint32_t nrf_power_usbregstatus_get(void);

/**
 * @brief Function for getting the VBUS input detection status.
 *
 * USBDETECTED and USBREMOVED events are derived from this information
 *
 * @retval false VBUS voltage below valid threshold.
 * @retval true  VBUS voltage above valid threshold.
 *
 * @sa nrf_power_usbregstatus_get
 */
__STATIC_INLINE bool nrf_power_usbregstatus_vbusdet_get(void);

/**
 * @brief Function for getting the state of the elapsed time for the USB supply output settling.
 *
 * @retval false USBREG output settling time not elapsed.
 * @retval true  USBREG output settling time elapsed
 *               (same information as USBPWRRDY event).
 *
 * @sa nrf_power_usbregstatus_get
 */
__STATIC_INLINE bool nrf_power_usbregstatus_outrdy_get(void);
#endif // NRF_POWER_HAS_USBREG

#ifndef SUPPRESS_INLINE_IMPLEMENTATION

__STATIC_INLINE void nrf_power_task_trigger(nrf_power_task_t task)
{
    *((volatile uint32_t *)((uint8_t *)NRF_POWER + (uint32_t)task)) = 0x1UL;
}

__STATIC_INLINE uint32_t nrf_power_task_address_get(nrf_power_task_t task)
{
    return ((uint32_t)NRF_POWER + (uint32_t)task);
}

__STATIC_INLINE void nrf_power_event_clear(nrf_power_event_t event)
{
    *((volatile uint32_t *)((uint8_t *)NRF_POWER + (uint32_t)event)) = 0x0UL;
#if __CORTEX_M == 0x04
    volatile uint32_t dummy = *((volatile uint32_t *)((uint8_t *)NRF_POWER + (uint32_t)event));
    (void)dummy;
#endif
}

__STATIC_INLINE bool nrf_power_event_check(nrf_power_event_t event)
{
    return (bool)*(volatile uint32_t *)((uint8_t *)NRF_POWER + (uint32_t)event);
}

__STATIC_INLINE bool nrf_power_event_get_and_clear(nrf_power_event_t event)
{
    bool ret = nrf_power_event_check(event);
    if (ret)
    {
        nrf_power_event_clear(event);
    }
    return ret;
}

__STATIC_INLINE uint32_t nrf_power_event_address_get(nrf_power_event_t event)
{
    return ((uint32_t)NRF_POWER + (uint32_t)event);
}

__STATIC_INLINE void nrf_power_int_enable(uint32_t int_mask)
{
    NRF_POWER->INTENSET = int_mask;
}

__STATIC_INLINE bool nrf_power_int_enable_check(uint32_t int_mask)
{
    return (bool)(NRF_POWER->INTENSET & int_mask);
}

__STATIC_INLINE uint32_t nrf_power_int_enable_get(void)
{
    return NRF_POWER->INTENSET;
}

